Python 3.3.5 (v3.3.5:62cf4e77f785, Mar  9 2014, 10:37:12) [MSC v.1600 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 1, in <module>
    x=int(input('Введите слово: '))
ValueError: invalid literal for int() with base 10: 'привет'
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 1, in <module>
    x=int(input('Введите слово: '))
ValueError: invalid literal for int() with base 10: 'привет'
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
привет
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
привет
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 4, in <module>
    word_length=len(word)
NameError: name 'word' is not defined
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
привет
6
>>> ================================ RESTART ================================
>>> 
Введите слово: привет, мир!
привет, мир!
12
>>> ================================ RESTART ================================
>>> 
Введите слово: привет
привет
6
Hooray!
Yupee
End!
>>> 2>0
True
>>> 2<=-120
False
>>> type(True)
<class 'bool'>
>>> x=True
>>> x
True
>>> not x
False
>>> ================================ RESTART ================================
>>> 
Введите слово: горманешка
горманешка
10
End!
>>> ================================ RESTART ================================
>>> 
Введите число: 4
4
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 7, in <module>
    if num>0:
TypeError: unorderable types: str() > int()
>>> ================================ RESTART ================================
>>> 
Введите число: 45
45
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 7, in <module>
    if num>0:
TypeError: unorderable types: str() > int()
>>> ================================ RESTART ================================
>>> 
Введите число: 45
45
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 7, in <module>
    if num>0:
TypeError: unorderable types: str() > int()
>>> ================================ RESTART ================================
>>> 
Введите число: 45
45
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 7, in <module>
    if num>0:
TypeError: unorderable types: str() > int()
>>> ================================ RESTART ================================4
>>> 
Введите число: 5
5
Traceback (most recent call last):
  File "C:/Users/student/Desktop/meow.py", line 7, in <module>
    if num>0:
TypeError: unorderable types: str() > int()
>>> ================================ RESTART ================================
>>> 
Введите число: 45
45
45 450
>>> ================================ RESTART ================================
>>> 
Введите число: 61
61
61 610
>>> ================================ RESTART ================================
>>> 
Введите число: -19
-19
190
>>> ================================ RESTART ================================
>>> 
Введите число: -8
-8
8
>>> ================================ RESTART ================================
>>> 
Введите число: 0
0
0 0
0
>>> ================================ RESTART ================================
>>> 
Введите число: 666
666
766
>>> ================================ RESTART ================================
>>> 
Введите число: 0
0
100
>>> ================================ RESTART ================================
>>> 
Введите число: 0
0
100
>>> ================================ RESTART ================================
>>> 
Введите число: -1
-1
bolshe -2
-1
>>> ================================ RESTART ================================
>>> 
Введите число: -1
-1
menshe nulya
bolshe -2
-1
>>> ================================ RESTART ================================
>>> 
Введите число: -1
-1
menshe nulya
bolshe -2
-1
>>> ================================ RESTART ================================
>>> 
Введите число: -3
-3
menshe nulya
ne bolshe -2
-3
>>> ================================ RESTART ================================
>>> 
Введите число: -3
-3
ne bolshe nulya
ne bolshe -2
-3
>>> ================================ RESTART ================================
>>> 
Введите число: 0
ne bolshe nulya
bolshe -2
0
>>> ================================ RESTART ================================
>>> 
Введите число: 7
>>> 3
3
>>> ================================ RESTART ================================
>>> 
Введите число: 3
num строго больше нуля или меньше или равно пяти
>>> ================================ RESTART ================================
>>> 
Введите число: 0
num строго больше нуля или меньше или равно пяти
>>> ================================ RESTART ================================
>>> 
Введите число: 
>>> ================================ RESTART ================================
>>> 
Введите число: 678
hello
>>> ================================ RESTART ================================
>>> 
Введите число1: 3
Введите число2: 12
num1 nechetnoye, a num2 - chetnoye
>>> ================================ RESTART ================================
>>> 
Введите число1: 670
Введите число2: 34
oni chetnye!!
>>> ================================ RESTART ================================
>>> 
Введите число1: 0
0
>>> ================================ RESTART ================================
>>> 
Введите число1: -5
-1
>>> ================================ RESTART ================================
>>> 
Введите число1: -9
-1
>>> ================================ RESTART ================================
>>> 
Введите число1: 2020
on visokosen !!!!!
>>> ================================ RESTART ================================
>>> 
Введите число1: 2013
>>> ================================ RESTART ================================
>>> 
Введите число1: 2012
on visokosen !!!!!
>>> 
